{
	"acceptation": "Acceptance",
	"acceptation_content": "<p>You acknowledge being a natural person having reached the age of majority, or, if you are minor, having obtained the authorisation of your legal guardian, in order to access Leek Wars.</p>\n<p>By using the website Leek Wars and/or by creating an account on Leek Wars, you acknowledge having read, understood and agreed with the General Terms and Conditions of Use, and consequently all the rules detailed here below.</p>",
	"access": "Access",
	"access_content": "<p>Leek Wars being a game accessible through the Internet, you are the only responsible for connection costs to the Internet. \n",
	"Leek": "Wars is not responsible for damages that could be inflicted to you because of the use of a connection to the Internet or of the installation of malware on your computer.  </p>\n<p>Leek Wars only confers you an exclusive and untransferable right of use (the use extends to any non-commercial use, characterised by the navigation, the participation, and the choice to suscribe to the different services) of its website and of its services, and consequently reserves the rights of exploitation, distribution, transfer, as well as any other rights on the elements constituting the game.</p>",
	"account_creation": "Creation of an account",
	"account_creation_content": "<p>You can create an account only if you are a natural person having reached the age of majority, or, if you are minor, having obtained the authorisation of your legal guardian.</p>\n",
	"<p>You": "can ask for a definitive deletion of your account, your AIs, and the whole of your datas on the website Leek Wars by emailing the Leek Wars team. The contact adress is indicated in the section \"Legal\".</p>\n",
	"<p>When": "creating your account, the following information will be asked to you: </p>\n",
	"<li>Farmer's": "name (or name of your account)</li>",
	"<li>Name": "of your first leek</li>",
	"<li>Your": "password</li>\n",
	"<p>The": "security of your account is your own responsability, Leek Wars is not responsible for damages on your account that would occur in case you share your username and corresponding password.</p>",
	"<li>It": "must not be written or spelled alternatively with the objective of bypassing the rules imposed here above</li>\n",
	"<li>There": "must not be any sexual and/or pornographic connotation</li>",
	"game": "Game",
	"game_content": "<p>You engage yourself not to insult nor threaten the other website users or members of the Leek Wars team. Identically, you engage yourself not to express any comments that could be qualified of racist, chocking, offensing, pornographic, discriminatory or in conflict with french laws, by the means of chats, forums, private messaging service, fights or any other communication means proposed by Leek Wars.</p>\n",
	"intellectual_property": "Intellectual Property",
	"intellectual_property_content": "<p>Leek Wars, its content, its services, its graphical services, its logo, are all submitted to the legislation of intellectual property. These elements are the propety of Leek Wars. You engage yourself to respect this legislation.</p>\n",
	"intro": "Leek Wars is a free multiplayer browser game.",
	"The": "current General Terms and Conditions of Use detail the conditions of use of Leek Wars.",
	"They": "constitute an agreement between the website user and the proposed service.",
	"private_life_and_cookies": "Private life and cookies",
	"private_life_and_cookies_content": "<p>By suscribing to Leek Wars, you accept the following data to be collected and conserved:</p>",
	"<ul><li>Email": "adress</li><li>IP adress</li></ul>\n",
	"<p>These": "datas are conserved in France in a secure environnment.</p>\n",
	"<p>In": "accordance with the \"Loi relative à l'informatique, aux fichiers et aux libertés n°78-17\" from January 6, 1978, you dispose of a right of access, modification, rectification and deletion concerning the datas collected by this website.</p>\n",
	"<p>Leekwars": "uses a cookies system for its own functioning. These cookies will eventually contain information related to the identification of the user.</p>",
	"responsability_and_security": "Responsability and Security",
	"responsability_and_security_content": "<p>In order to guarantee the security of your account, you engage yourself:</p>",
	"<ul><li>Not": "to give access to your account to anyone. Accounts loaning, sharing, exchanging, giving, purchasing, selling and transfering are forbidden. </li>",
	"<li>Not": "to reveal your password. </li>",
	"<li>To": "use a personal mailbox and be the only user of this mailbox  </li></ul>\n",
	"sanctions": "Sanctions",
	"sanctions_content": "<p>In case of infringement of one or several rules detailed in the current General Terms and Conditions of Use, the Leek Wars team reserves the right to restrict your access to the game, without any preliminary warning and at its sole discretion.</p>\n",
	"<p>Sanctions": "include simple warnings, definitive deletion of your account, and any conceivable intermediate measure.</p>\n",
	"<p>If": "you acquire by fraudulous means (for instance through flaws, bots, cheating technicals, farming, stealing) items or money in the game, the Leek Wars team reserves the right to access your own account and delete the whole or a part of your inventory, and equally to modify your attributes (Habs, levels, points in every characteristics of the game).</p>",
	"title": "General Terms and Conditions of Use",
	"version_n": "Version {0}"
}