{
	"forum_topic": "Sujet forum",
	"popup_ok": "OK :)",
	"see_all_changes": "Retrouvez la liste complète des changements sur la page {changelog}.",
	"title": "Historique des modifications",
	"title_0" : "🌟 Nouveautés",
	"title_1" : "⚒️ Améliorations",
	"title_2" : "🐞 Corrections",
	"version_n": "Version {0}",
	"version_online": "Version {version} en ligne !\n",
	"changelog_100": "# Version 1.0 en ligne, fin de la version bêta !\n# Tous les joueurs inscrits avant le 6 juin reçoivent le trophée Bêta Testeur.",
	"changelog_101": "# Ajout de la vente d'arme => redonne 80% du prix initial de l'arme.\n# Possibilité de changer le grade des membres d'une équipe.\n# Introduction du système de parrains\n# Ajout de la page changelog\n# Ajout de trophées",
	"changelog_102": "# Amélioration de l'éditeur, concernant la création, le changement de nom, et la suppression des IA.  Pour les créateurs d'extensions => ça risque de causer des soucis.\n# Ajout de trophées",
	"changelog_103": "# Ajout de la fonction getInstructionsCount(), pour récupérer le nombre d'instructions que le poireau a effectué durant le tour actuel.\n# La limite d'instructions maximum monte à 10 000. Cette valeur est disponible avec la constante INSTRUCTIONS_LIMIT.\n# Le nombre maximum de défis par jour monte à 200.\n# Ajout de trophées",
	"changelog_104": "# Limitation à 5 000 debug() maximum par combat\n# Ajout de la possibilité de faire uneFonction()[0] sur les fonctions retournant un tableau\n# Accéder à une case inexistante d'un tableau n'a plus pour effet de créer cette case dans le tableau",
	"changelog_105": "# Correction du bug de génération des combats\n# Correction de getCellToUseWeapon pour les portées linéaires (laser)\n# Amélioration de l'éditeur pour gérer un grand nombre d'IA",
	"changelog_106": "# Améliorations de l'éditeur.\n# Ajout du bouton agrandir/rétrécir.\n# Combats : options pour choisir la taille du combat et afficher les informations de debug.\n# Amélioration du plein écran sur Firefox.\n# Ajout du mode tactique (option en combat).\n# Ajout d'une option pour régler la qualité de l'affichage.\n# Ajout de getWeaponTargets(cell).\n# L'erreur \"Fonction inconnue\" devient plus explicite et ne fait plus planter l'IA, la valeur null est retournée.",
	"changelog_107": "# Améliorations des performances des combats (hud, décor).",
	"changelog_108": "# Ajout de l'opérateur === et !== qui comparent le type et la valeur de deux expressions.",
	"changelog_109": "# Ajout de la possibilité de supprimer un message sur le forum, ainsi qu'un sujet (pour les modérateurs).\n# Page de team : affichage des éleveurs connectés.\n# Ajout des boutons \"Mon poireau\", \"Mon éleveur\" et \"Mon équipe\" dans le classement.\n# Améliorations des notifications des messages privés.\n# Ajout de grandes notifications dans le coin bas-droit de la page pour les messages privés.\n# Amélioration de la visibilité du joueur courant dans les combats.",
	"changelog_110": "# Ajout d'un compteur de capital sur les onglets des poireaux.\n# Ajout de la date d'obtention de chaque trophée sur le profil de l'éleveur.\n# Ajout d'une option pour afficher les barres de vie de tous les joueurs en combat.\n# Amélioration de la gestion des erreurs de l'affichage des combats.",
	"changelog_111": "# Réimplémentation de la méthode subArray, push et pushAll.\n# Fix du bug de getFarestAlly et getFarestEnemy.\n# Fix du bug des double convertis en int lorsque l'on utilise l'opérateur \"-\".",
	"changelog_112": "# Ajout du cache pathFinding, permet de meilleures performances en combat.\n# Fix des trophées sur le nombre de victoires.\n# Amélioration de l'édition de la description de la team.",
	"changelog_113": "# Ajout des tournois de farmer, tous les jours de 12h à 14h.\n# Ajout de 5 trophées pour les tournois de farmer.",
	"changelog_114": "# Affichage des trophées en liste (triée par ordre d'obtention) ou en grille (triée par numéro de trophée).",
	"changelog_115": "# Amélioration de l'aide générale, avec l'aide de PadiSson et McNalYoo.\n# Ajout de la recherche sur le forum (version basique).\n# Fonction de modération forum : verrouiller un sujet.",
	"changelog_116": "# Fonction \"accrocher\" pour un sujet du forum.\n# Possibilité de mettre son topic en résolu sur le forum.\n# Amélioration de l'affichage des balises codes dans le forum.\n# Ajout de la fonction getAllies() dans la documentation.\n# Amélioration de la fonction recherche sur le forum.",
	"changelog_117": "# Amélioration de l'édition des noms des IAs.\n# Dates plus propres sur le forum.\n# Un poireau peut équiper une IA trop haut level pour lui, mais il plantera uniquement à l'éxécution de celle-ci, avec une erreur explicite, et non directement au début de son tour. Cela permet de créer des IA pour plusieurs levels, en rajoutant des conditions if (getLevel() > X) fonction().\n# Rééquilibrage des armes et des puces : voir <a href='http://leekwars.com/forum/category-6/topic-800'>http://leekwars.com/forum/category-6/topic-800</a>",
	"changelog_118": "# Ajout de l'animation de la météorite.\n# Correction de \"getFarest*\" en getFarthest*, l'ancienne version existe toujours mais n'est plus référencée dans la doc.",
	"changelog_119": "# Correction des dégâts de la météorite (système ancien : dégâts inversement proportionnels à la distance avec le lanceur).",
	"changelog_120": "# Ajout de l'animation de la puce Libération.\n# Affichage de la file d'attente des combats.\n# Ajout de l'avatar Gravatar si pas d'avatar.",
	"changelog_121": "# Option mode discret (SFW).",
	"changelog_122": "# Affichage des grades des éleveurs d'une team pour les éleveurs non membres.\n# Le coût d'un PT ou d'un PM passe à 100 capital.\n# Le coût d'un coeur passe à 50 capital.",
	"changelog_123": "# Amélioration du mode discret\n# Affichage des combats en cours de génération en blanc dans l'historique.\n# Passage à 30 combats par jour pour les niveaux < 50.\n# Ajout d'un rappel sur la candidature en cours pour une team sur la page du farmer.\n# Bouton revanche ajouté à la fin d'un défi.\n# Rajout d'infos dans les résultats de recherche (catégorie).\n# Affichage des combats en team restant pour chaque poireau sur la page de l'équipe.\n# Ctrl+C ne marque plus l'IA comme modifiée\n# Ajout du raccourci Ctrl+Q pour tester l'IA.\n# Modification des fonctions : getForce, getLife, getPM, getTP, getAgility, getAbsoluteShield, getRelativeShield, getTotalLife, getLevel, getName qui retournent désormais null quand le poireau n'existe pas\n# Modification de la fonction getWeapon : retourne null quand aucune arme n'est équipée\n# Il n'est maintenant plus possible déclarer des globales ailleurs que dans le bloc principal\n# Les variables ne sont plus plus passées par référence dans les fonctions utilisateurs\n# Les mot clés du LeekScript ne sont plus utilisables comme nom de variables\n# Fix du do/while",
	"changelog_124": "# Affichage des debugs personnels avec une police monospace (merci HS).\n# Les touches Maj, Shift, Alt et Alt Gr ne marquent plus l'IA comme modifiée.\n# Favicon enlevé en mode discret.\n# Amélioration du matchmaking solo, équipe et farmer du potager.\n# Ajout d'une protection contre les attaques en boucle.",
	"changelog_125": "# Affichage des logs personnels (debugs) directement dans le combat.\n# Bouton retour à l'éditeur pour un test en équipe.\n# Affichage des totaux dans le rapport de combat.\n# Les retours à la ligne sont préservés dans les logs personnels.\n# Ajout du passage par référence dans les fonctions utilisateurs via l'opérateur @.\n# Ajout de la structure for (var key : var value in array) { ... }.\n# Correction de la copie des tableaux.",
	"changelog_126": "# Ajout des fonctions getCores() et getFrequency().\n# Ajout de la documentation de for ... in dans le tutoriel.\n# Ajout des fonctions getFightContext() et getFightType().\n# Possibilité d'appeler des fonctions déclarées n'importe ou dans le code.\n# Les coeurs font baisser le taux d'échec des puces et des armes : échec = (échec de base) - (coeurs - 1).\n# Le coût d'un coeur descend à 10 capital.",
	"changelog_127": "# Ajout du tutoriel sur les opérateurs == et ===.\n# Amélioration de la page \"À Propos\".\n# Affichage des carrés de notification en direct.\n# Coloration des constantes et fonctions du LeekScript.\n# L'éditeur devient une simple zone de texte sur mobile, pour faciliter une édition rapide (l'éditeur normal est accessible avec l'option \"Voir version ordinateur\" sur votre téléphone).\n# Améliorations sur mobile (superpositions de texte, taille de texte).",
	"changelog_128": "# Ajout du tutoriel sur le passage par référence.\n# Match highlight dans l'éditeur (surligne les occurences de la sélection courante).\n# Ajout des include(), syntaxe : include(\"nom_ia\");",
	"changelog_129": "# Modification de l'opérateur == : voir le fonctionnement détaillé dans la partie \"Avancée\" du tutoriel.\n# Option couper le son dans un combat.",
	"changelog_130": "# Ajout des fonctions <i>number</i> et <i>string</i>, pour convertir en nombre et en chaîne.",
	"changelog_131": "# Éditeur : affichage de la ligne courante\n# Éditeur : auto-fermeture des (), [], {}, '' et \"\".\n# Affichage des puces non équipés dans les avertissements (dans le rapport de combat).\n# Ajout de la fonction getAliveEnemiesCount.\n# Ajout de l'opérateur \"not\", équivalent à !.\n# Ajout des fonctions <i>removeKey</i>, <i>assocSort</i> et <i>keySort</i>.\n# Ajout d'un bouton aide pour les raccourcis clavier dans l'éditeur.",
	"changelog_132": "# Affichage des bulles par dessus les décors.\n# Vitesse supplémentaire en combat.\n# Ajout de la possibilité de déclarer un tableau associatif : [key1: value1, key2: value2].\n# Ajout des fonctions getNearestEnemyTo(leek), getNearestEnemyToCell(cell), getNearestAllyTo(leek), getNearestAllyToCell(cell).\n# Ajout des fonctions getWeaponEffectiveArea(cell), getChipEffectiveArea(chip, cell).\n# Ajout des fonctions getCellsToUseWeapon(leek), getCellsToUseWeaponOnCell(cell), getCellsToUseChip(leek), getCellsToUseChipOnCell(cell).\n# Ajout des fonction getWeaponFailure(weapon_id), getChipFailure(chip_id).\n# Correction des priorités dans les ternaires.\n# Les tableaux simples sont désormais affichés sans leur clés.\n# Ajout du système de Talent.",
	"changelog_133": "# Affichage de la ligne de plantage ou d'avertissement lors de l'éxécution d'une IA.\n# Le talent est désormais accessible uniquement à partir du niveau 100.\n# Modifications des classements.\n# Tris par colonne dans le classement.",
	"changelog_134": "# Mise à jour du matchmaking pour les niveaux < 100.",
	"changelog_135": "# Ajout des potions (réinitialisation du capital et coloration du poireau).\n# Les chips sont désormais revendables.\n# Une chip ne peut être équipée que sur un seul poireau à la fois.\n# Ajout de la sagesse, qui augmente l'xp et les habs : xp = xp * (1 + sagesse / 100).\n# Ajout de la page inventaire.",
	"changelog_136": "# Éditeur : Option pour désactiver la fermeture automatique des parenthèses\n# Éditeur : Option fermeture automatique des parenthèses améliorée.\n# Éditeur : Amélioration de l'autocomplétion : rajout de la documentation, et des informations sur les puces et les armes.\n# Éditeur : Informations sur la fonction, arme ou puce au survol de son nom dans le code.\n# Éditeur : Ajout de raccourcis (for, if, while, ...).\n# Éditeur : Option pour choisir la taille du texte.\n# Éditeur : Thème sombre (Monokai) disponible.\n# Modification des formules de gain d'XP, de talent et d'Habs (l'XP et les Habs sont calculées en fonction du talent) : voir le topic http://leekwars.com/forum/category-6/topic-1836.",
	"changelog_137": "# Ajout d'un lien de parrainage (sur la page de l'éleveur).\n# Éditeur : Ctrl-Q et Ctrl-S fonctionnement même si l'éditeur n'est pas focused.\n# Ajout de l'aide sur la sagesse.\n# Ajout d'un bouton signaler sur la page de l'éleveur.\n# Ajout de la puce téléportation.\n# Ajout des fonctions anonymes.",
	"changelog_138": "# Ajout du B-Laser.\n# Modification de l'éditeur, variables et fonctions utilisateurs dans l'autocomplétion (y compris dans les includes).\n# Changement des id de puces et armes (ils ne se chevauchent plus).\n# Suppression du slot d'ia de team.\n# L'opérateur de puissance est désormais l'opérateur **.\n# Ajout des opérateurs binaires &, |, ^, <<, >> et >>>.\n# Modification du fonctionnement des fonction getWeaponEffects et getChipEffects.\n# Ajout du lien vers le Wiki dans l'aide.",
	"changelog_139": "# Ajout des fonctions mark(cell), mark(cell, color), mark(cell, color, duration) pour colorer des cases.\n# Ajout des opérateurs |= , &= et ^=.\n# Option dans l'éditeur pour activer l'autocomplétion ou pas.\n# getCurrentCooldown() devient getCooldown().\n# Tutoriel sur les fonctions anonymes.\n# Ajout de la fonction lineOfSight(cell1, cell2).",
	"changelog_140": "# Autocomplétion des include() d'include() dans l'éditeur.\n# Fonctions isChip() et isWeapon() pour déterminer si une constantes est une puce ou une arme.\n# Amélioration du système de comptage, et passage à 300 000 instructions maximum par tour.\n# Fonction listen() pour récuperer un tableau des say() des joueurs précedents.\n# Fonction typeOf() pour déterminer le type d'une valeur.\n# Fonction pause() pour mettre en pause le combat à un instant donné.\n# Fonctions show(cell) et show(cell, color) pour montrer une cellule (coûte 1PT).\n# Fonction lineOfSight(cell1, cell2, leekToIgnore) pour ignorer un poireau.\n# Fonction getPath(cell1, cell2, leekToIgnore) pour ignorer un poireau.\n# Fonction getLeekID() pour récupérer l'id réel du poireau.\n# Fonctions getRed(color), getGreen(color), getBlue(color) pour récupérer le rouge, vert, bleu d'une couleur.\n# Option pause discrète.\n# color() devient getColor().",
	"changelog_141": "# Ajout des défis d'éleveur.\n# Explicitation de plusieurs fonctions dans la documentation.\n# Amélioration des bots (au niveau des caractéristiques et leur équipement).\n# Ajout de 2 bots supplémentaires.\n# Notification quand quelqu'un commente votre tournoi.\n# Ajout de la fonction getWeaponTargets(weapon, cell).\n# Ajout de la fonction getWeaponEffectiveArea(weapon, cell).\n# Ajout de la fonction canUseWeapon(weapon, leek).\n# Ajout de la fonction canUseWeaponOnCell(weapon, cell).\n# Ajout de la fonction getCellToUseWeapon(weapon, leek) et getCellToUseWeaponOnCell(weapon, cell).\n# Ajout de la fonction getCellsToUseWeapon(weapon, leek) et getCellsToUseWeaponOnCell(weapon, cell).\n# Sauvegarde des paramètres de test dans l'éditeur.\n# Ajout du test d'éleveur.",
	"changelog_142": "# Ajout des tournois de team.\n# Ajout des cristaux, deuxième monnaie du jeu, achetables depuis la banque (avec PayPal ou StarPass).\n# Ajout des skins Transparent, Multicolore, Rasta, Noir, Blanc, Vert pomme.\n# Affichage du nombre de lignes et caractères d'une IA.\n# Les compteurs de temps s'adaptent au fuseau horaire du joueur.",
	"changelog_143": "# Unification forum de team au forum général.\n# Amélioration du pathfinding.\n# Correction de petits bugs du LeekScript.\n# Ajout de popups de confirmation pour les achats du marché.\n# Ajout d'un didactitiel.\n# Ajout de l'aperçu des potions de couleur dans le marché.",
	"changelog_144": "# Prise en compte du nombre de paramètre lors du survol d'une fonction dans l'éditeur.\n# Fonction recherche dans le classement.\n# Corrections des problèmes des teams.\n# Correction de la recherche forum.\n# Correction des bugs des tournois.",
	"changelog_145": "# Changement de serveur.\n# Recherche des messages pour un joueur précis dans le forum.\n# Bouton signaler sur un poireau.",
	"changelog_146": "# Correction des bugs avec les forums de team.\n# Constantes EFFECT_FORCE/AGILITY/TP/MP renommées en EFFECT_BUFF_FORCE/AGILITY/TP/MP.\n# Ajout des fonctions getFarmerID([leek]), getFarmerName([leek]), getTeamID([leek]), getTeamName([leek]), getAIID([leek]), getAIName([leek]).\n# Correction des caractéristiques des bots de test.",
	"changelog_147": "# Amélioration du matchmaking (solo, farmer et team).\n# Le talent est bloqué dans le matchmaking au delà d'un certain seuil.\n# Ajout des fonctions getWeaponEffectiveArea() et getChipEffectiveArea() avec un 3ème paramètre pour définir la cellule de lancer.\n# Le nombre d'obstacles sur la map est plus aléatoire.\n# Indicateur pour les potions réutilisables dans le marché.\n# Correction de la difficulté des bots de test.",
	"changelog_148": "# Le niveau maximum passe à 300. Les deux armes (Électriseur et M-Laser passent niveau 257 et 300).\n# Les poireaux gagnent 5 points de capital par niveau, et 50 au niveau 100, 200 et 300. Un nouveau poireau commence avec 50 points de capital également.\n# Le poireau commence le jeu avec 100 points de vie, 10 points de tour et 3 points de mouvement.\n# Un point de tour coûte 80 points de capital, et un point de mouvement 50.\n# Les poireaux n'obtiennent plus de PT/PM/Coeur tous les 100 niveaux.\n# La formule de la sagesse passe à [XP, Habs] * 1 + sagesse / 300.\n# La puce Éboulement passe à 6PT au lieu de 7.\n# La puce Foudre voit sa portée maximale réduite à 5, au lieu de 6 auparavent.\n# Ajout de la puce Inversion, qui permet d'échanger la position de deux joueurs.\n# Ajout de la puce Blindage qui permet de rajouter de la vie totale à un joueur (effet boosté par l'agilité comme pour les soins).\n# Correction du bug de la météorite lancée dans le vide.\n# Ajout d'une animation pour téléportation.\n# Amélioration des notifications de réponse forum.",
	"changelog_149": "# Ajout des 6 constantes TYPE_* dans le documentation.\n# Ajout des citrouilles pour Halloween.\n# L'utilisation d'un nom de fonction pour un nom de variable est interdite (correction de bug).\n# Les fonctions getCell(s)ToUse* fonctionnent avec les puces non équipées.\n# Implémentation du ++i.\n# Ajout du do while dans le tutoriel.\n# Modification des horaires de tournois : 12-14h : solo, 18-20h : éleveur, 21-23h : équipe.\n# Correction du trophée Collectionneur.",
	"changelog_150": "# Affichage du talent sur la page de l'équipe.\n# Affichage des horaires des tournois sur les boutons.\n# Implémentation des fermetures (voir le sujet sur le forum).\n# Affichage des dates des tournois et des combats sur leur page.",
	"changelog_151": "# La limite de debug est calculée sur la longueur totale de texte affiché, cette limite est de 1 000 000 de caractères.\n# La sagesse applique désormais le multiplicateur sur l'XP et les Habs uniquement en cas de victoire.\n# Corrections diverses.",
	"changelog_152": "# Affichage des bulles par dessus les noms des poireaux.\n# Les fonctions getPath et getPathLength acceptent désormais un tableau en 3ème paramètre, le tableau des cellules à ignorer.\n# Corrections des notifications de défi d'éleveur.\n# Le trophée beta testeur passe en trophée bonus (ne compte pas dans le total de trophées).\n# Correction des trophées relatifs aux tournois d'équipes.\n# Correction du nombre de combats pour un nouveau poireau (50 combats qui repassent à 20).",
	"changelog_153": "# Modification du trophée Boosté.\n# Correction de replace() et split().\n# Ajout de la fonction getObstacles().\n# Trophées pour le level 300 et 400 passés à 250 et 300.\n# Bug du choix de l'IA en combat de test éleveur corrigé.\n# Répartition des dégâts de zone pour Éclair et Électriseur corrigée.\n# Inversion des constantes RELATIVE_SHIELD et ABSOLUTE_SHIELD corrigée.\n# Modifications sur get[Chip,Weapon]EffectiveArea() : portée min et max prise en compte, pas les lignes de vue.\n# Documentation de la fonction pause() ajoutée.\n# Correction trophée Statique.\n# Défilement vertical à l'intérieur des popups.\n# Choix du pays disponible et affichage du pays dans le classement.\n# Ajout de la fonction getCooldown(chip, leek).\n# Ajout des fonctions getCell(s)ToUse[Chip,Weapon](OnCell) avec un paramètre supplémentaire qui correspond aux cellules à ignorer.",
	"changelog_154": "# Ajout du choix de la langue pour le forum.\n# Ajout du choix de la langue pour le chat.\n# Le moveToward est désormais capable d'avancer vers une cellule qui est un obstacle : elle s'approche au maximum de cette case.\n# Correction des combats bloqués en file.\n# Correction trophée Résistant à Invincible\n# Amélioration du fil d'ariane du forum",
	"changelog_155": "# Changement de la formule du power = (level * (1 + (talent - 1000) / 5000)) ^ 3\n# Changement du matchmaking solo : les adversaires proposés sont de niveau et talent plus proche\n# Correction de moveAwayFromLine\n# Modification de l'électriseur : 6PT => 7PT et 70 à 90 => 70 à 80 dommages\n# Modification d'éboulement : 6PT => 5PT\n# Les dégâts de durée de Lance-flammes et Gazeur sont désormais de type poison et ne sont pas réduis par les boucliers.\n# Modification de Vaccin : soigne de 30 à 32 => 34 à 38 sur 3 tours\n# Corrections des chats et des forums de team",
	"changelog_156": "# Ajout des chapeaux\n# Correction des armes des bots",
	"changelog_157": "# Possibilité de changer le propriétaire d'une équipe\n# Zones de saisie sur plusieurs lignes pour le chat et les messages privés.\n# Le matchmaking des tournois ne se fait plus en fonction du talent.\n# Possibilité d'utiliser les fonctions getCell(s)ToUse(Weapon/Chip)OnCell avec un obstacle en cellule cible.\n# Amélioration de la fonction pause() qui pause bien au bon moment avec les mark() et les debug().\n# Popup avec les modifications lors d'une maj.\n# Corrections des traductions manquantes dans le combat.\n# Ajout des dates des messages du chat et des messages privés au survol.\n# Ajout d'icônes dans les rapports de combats lors d'un perfect (l'équipe gagne avec toute sa vie à la fin du combat) ou d'un \"statique\" (quand toute l'équipe n'a pas bougé).\n# Ajout des fonctions getChipArea() et getWeaponArea() qui renvoient le type de zone de la puce ou de l'arme, parmis les constantes AREA_* (voir dans la documentation).\n# Petites corrections du mode discret.\n# Diverses corrections de traduction.\n# Correction de l'historique des combats d'éleveur.\n# Correction du niveau total éleveur dans le classement.\n# Les fonctions n'ont plus de restriction au niveau des coeurs.\n# Chaque fonction possède désormais un nombre d'opérations (indiqué dans la documentation), les fonctions évoluées coûtent plus en opérations (tous les coûts ne sont pas encore définitivement estimés).\n# Possibilité d'enlever son chapeau.\n# Amélioration de l'IA des bots.\n# Changements importants dans l'architecture des serveurs (en vue de la sortie de la version anglaise).",
	"changelog_158": "# Ajout des registres.\n# Modifications dans l'architecture des serveurs.\n# getPathLength() renvoie null si le chemin entre les deux cases n'existe pas.",
	"changelog_159": "# Ajout d'un trophée.\n# Lien du wiki dans l'aide.\n# Correction des avatars.\n# Ajout de l'opérateur + pour les tableaux.\n# Ajout des fonctions arrayMap, arrayFilter, arrayFlatten, arrayFoldLeft, arrayFoldRight, arrayPartition, arrayIter, arrayConcat et arraySort\n# Ajout de la possibilité de redéfinir les fonctions du LeekScript.",
	"changelog_160": "# Possibilité de renommer ses poireaux.\n# Correction du trophée concis.\n# Correction des fonction arrayFold.\n# Lancement de la version anglaise !",
	"changelog_161": "# Modification du système de Talent\n# Trophée traducteur pour tous les participants à la traduction du site.",
	"changelog_162": "# Modification des matchmaking solo et farmer, réinitialisation du talent en fonction du niveau.\n# Ajout de boutons +10 et +100 pour répartir plus facilement ses caractéristiques sur son poireau.\n# Ajout de classements \"funs\".\n# Correction de l'xp des teams.",
	"changelog_163": "# Ajout du gain d'xp et d'argent en fonction de notre talent par rapport à la moyenne de notre niveau.\n# Correction du trophée niveau 300.\n# Correction des lignes des erreurs dans le LeekScript.",
	"changelog_164": "# Ajout de 3 puces d'invocation de bulbes.\n# Ajout de la fonction summon(chip, cell, ai) pour invoquer.\n# Ajout de la fonction isSummon() et isSummon(entity) pour savoir si une entité est une invocation.\n# Ajout de la fonction getSummoner() et getSummoner(entity) pour connaitre l'invocateur d'une entité.\n# Ajout de la fonction getType() et getType(entity) pour connaître le type d'une entité (poireau ou bulbe).\n# Ajout de la fonction getBirthTurn() et getBirthTurn(entity) pour connaitre le tour où est apparu une entité.",
	"changelog_165": "# Ajout de 25 trophées.\n# Ajustement de la puissance des invocations.\n# Ajout du bonus de gains en combats d'éleveur.",
	"changelog_166": "# Ajout d'une option pour s'abonner et se désabonner d'un sujet sur le forum.\n# Ajout des boutons de vote sur les messages du forum.\n# Correction de la fonction isAlive().\n# Correction du trophée Pacifiste.\n# Amélioration du matchmaking Solo, pour privilégier les adversaires que l'on a pas affronté dans la journée.\n# Correction des constantes ENTITY_*, qui sont maintenant correctes.\n# Correction de la limite d'invocations, qui est bien de 4.",
	"changelog_167": "# Ajout du formatage dans le forum.\n# Ajout de l'affichage des noms des votants dans le forum.\n# Correction des constantes FIGHT_CONTEXT_*\n# Correction des fonctions isAlive et isDead pour les invocations\n# Correction de arraySort() qui renvoie désormais le tableau trié.\n# Correction de la barre d'XP de team niveau 100.",
	"changelog_168": "# Ajout de la fonction getEntityTurnOrder(entity), qui renvoie l'ordre de jeu pour une entité donnée (et getEntityTurnOrder() qui renvoie le notre).\n# La limite d'invocations a été corrigée, elle est bien de 4 bulbes par poireau en simultané sur le terrain.\n# La réduction due à la zone de dégâts est appliquée AVANT les boucliers lors du calcul des dommages (auparavant ils étaient appliqués après).\n# Une fonction déclarée sous la forme var f = function() {} a accès a elle-même dans son corps.\n# Correction du compteur de combats affiché sur la page de l'éleveur : le compteur prend en compte tous les combats effectuées par l'éleveur (solo, farmer et team).\n# Les bulbes vont être modifiés (surtout le Healer Bulb et un peu le Fire Bulb), voir le sujet dans le forum (Mise à jour 1.68).\n# L'opérateur \"is\" va être introduit, veillez à enlever les éventuelles variables du même nom dans votre ia pour la prochaine maj ;)\n# La puce résurrection va être remplacée par \"régénération\", son ID ne change pas, mais si vous utilisez la constante (CHIP_RESURRECTION) dans votre IA, mieux vaut la remplacer par sa valeur (35), le temps que la nouvelle, CHIP_REGENERATION soit disponible.\n# Popup présentant les nouveautés lorsqu'un poireau passe un niveau.",
	"changelog_169": "# La puce \"Résurrection\" devient \"Régénération\".\n# Ajout des Bubles : Métallique, Glacé, Foudroyant et Rocheux.\n# Ajout des puces Rémission et Carapace, spécialisées pour les invocations.\n# Ajout de l'opérateur \"is\" et \"is not\", équivalents à == et !=.\n# Ajout de la potion dorée.\n# Ajout du chapeau \"couronne\".\n# Ajout des constantes EFFECT_TARGET_* dans la documentation.\n# Affichage des caractéristiques et des puces des bulbes dans le marché.\n# Ajout de la constante USE_TOO_MANY_SUMMONS, renvoyée par la fonction summon() si vous avez déjà 4 invocations vivantes sur le terrain.",
	"changelog_170": "# Ajout de la puce Résurrection.\n# Annonce de quelques changements au niveau des puces et des armes (voir le forum, maj 1.70).\n# Les caractéristiques des bulbes sont maintenant indexées sur le niveau de l'invocateur, entre le niveau 1 et 300 (301 avant).\n# Ajout de sa position dans les classements funs.\n# Ajout de 3 trophées.\n# Meilleur affichage des informations sur l'XP (pour les poireaux et les équipes), avec l'affichage de l'XP restante.\n# Ajout du nombre de points de vie et points de capital gagnés dans les popup de niveau.\n# getBirthTurn() renvoie 1 et pas 0 quand on est un poireau.\n# Correction de l'attribut statique dans certains combats.\n# Correction du talent d'éleveur au delà de 1200 de niveau total.",
	"changelog_171": "# Ajout du nouveau comptage des opérations, accessible avec la fonction getOperations().\n# Modification de certaines puces, comme annoncé lors de la maj 1.70. (Voir forum)\n# Séparation du compteur de combats farmer et général.\n# Correction nombre de capital au niveaux 100, 200, 300.",
	"changelog_172": "# Corrections des nombres d'opérations des fonctions\n# Mise en place de la limite à 20M opérations\n# Ajout du chapeau Arlequin\n# Ajout de la puce Frappe du démon",
	"changelog_173": "# La fréquence a été modifée : l'équipe qui a la plus haute fréquence a la plus grande probabilité de commencer le combat.\n# Ajout de la constante CHIP_RESURRECTION.\n# Ajout de la constante OPERATIONS_LIMIT.\n# Ajout de la constante EFFECT_TELEPORT, EFFECT_INVERT et EFFECT_RESURRECT.\n# Ajout des fonctions getStrength() et getStrength(leek), ainsi que EFFECT_BUFF_STRENGTH qui remplaceront les versions avec \"force\".\n# Supression de la puce Frappe du Démon, ajoutée par erreur.",
	"changelog_174": "# Correction du coût en opérations de certaines fonctions et opérateurs.\n# Ajout de la puce Frappe du Démon.\n# Fréquence active selon la nouvelle formule.",
	"changelog_180": "# Nouveau design\n# Design responsive\n# Amélioration des performances du site\n# Ajout d'un panneau avec les notifications/message/chat sur la droite (grands écrans)\n# Graphique d'évolution du talent solo sur une semaine\n# Suppression du compte : possibilité ou non d'effacer les messages sur le forum\n# Popup de répartition du capital avec bouton réinitialiser\n# Classement en page d'accueil\n# Barre de progression en combat (merci à jojo123)\n# Ajout de la constante EFFECT_SUMMON (= 14)\n# Ajout des carrés de couleur verte pour les tournois d'équipes\n# Amélioration des performances de l'éditeur\n# Possibilité d'éditer et supprimer les registres depuis la page du poireau\n# Boutons pour le classement de chaque poireau dans le classement\n# Possibilité de s'inscrire au tournoi pendant que celui du jour est en cours",
	"changelog_181": "# Changement de la limite des armes et des puces.\n# Affichage du nombre de tournois gagnés (solo, éleveur et équipe).\n# Correction de bugs.",
	"changelog_182": "# Amélioration de la fonction lineOfSight.\n# Ajout du chapeau Haut-de-forme\n# La puce frappe du démon a désormais une répartition linéaire, et frappe 5 x 25.\n# Corrections de bugs",
	"changelog_183": "# La limite d'invocation passe à 4 par équipe.\n# Les caractéristiques des bulbes sont diminuées.\n# Les cooldowns des bulbes sont communs au sein d'une équipe.\n# Les puces réservées aux invocations fonctionnent sur toutes les invocations.\n# Ajout de 4 nouvelles puces pour les invocations : Fouet, Accélération, Engrais et Fertilisant.",
	"changelog_184": "# Ajout de la fonction getMapType() pour récupérer le type de carte.\n# La fonction getNearestAlly() est maintenant niveau 1.\n# Correction du bug quand une IA était vide.\n# Ajout de la documentation de l'API.\n# Ajout d'un cooldown initial de 1 sur Inversion et Téléportation.\n# Coûts réduits pour les puces de bulbes.\n# Correction des bugs de tournoi.\n# La portée maximale du M-Laser passe à 12.",
	"changelog_185": "# Ajout des caractéristiques Résistance, Magie et Science.\n# Suppression des cœurs et des échecs.\n# Ajout des coups critiques (augmentés par l'agilité).\n# Changement des formules de calcul des soins : augmentés par la sagesse\n# Changement des formules de calcul des boucliers : augmentés par la résistance.\n# Changement des formules de calcul des boosts : augmentés par la science\n# Ajout d'une nouvelle catégorie de puces : les entraves, augmentées par la magie.\n# Ajout de puces de renvoi de dégâts, augmentés par l'agilité.\n# Ajout de puces de poisons, augmentés par la magie (comme le gazeur et le lance-flammes également).\n# Ajout des fonctions getWisdom([leek]), getResistance([leek]), getMagic([leek]) et getScience([leek]).\n# Ajout des fonctions getTotalMP([leek]) et getTotalTP([leek]).\n# Ajout de la fonction getLaunchedEffects([leek]).\n# Ajout des fonctions chipNeedLos(chip) et weaponNeedLos([weapon]).\n# Ajout de statistiques et d'un graphique dans le rapport du combat (merci à jojo123).\n# Correction des contantes MAP_*.\n# Correction du bug de date d'édition des topics.\n# Correction getCellToUseOnCell qui renvoyait des cases alors qu'on ne pouvait pas tirer sur la case.",
	"changelog_186": "# Trophées Chic et Élégant déblocables.\n# 3 trophées impossibles à obtenir le sont désormais, et passent en bonus.\n# Correction inversion.\n# Correction des tournois d'éleveur (qui ne se lançaient pas).\n# Correction du parrainage.\n# Correction de certaines notifications qui n'arrivaient pas en direct.\n# Correction de visualisation de certains combats, à cause de say().\n# Rajout du dernier trophée de tournoi d'équipe.\n# Correction de l'actualisation des objets achetés (armes, puces,chapeaux et potions).\n# Correction de la barre de progression\n# Les boucliers et les boosts ne peuvent être lancées que sur les alliés.\n# Adrénaline et Bottes ailées ont été augmentés.",
	"changelog_187": "# Refonte de l'interface de combat.\n# Correction des trophées légende et mythique.\n# Correction du bug de Libération.\n# Trophées relatifs aux cristaux (bonus) sont implantés.\n# 20 potions de réinitialisation offertes à la création du compte (20 potions ont été données pour tout le monde aussi).\n# Ajout de la fonction trim(string).\n# (Ré)affichage des multiplicateurs de gains en tournoi.\n# Amélioration de la recherche dans l'éditeur (boutons suivant et précédent, et total).",
	"changelog_188": "# Nouvelle page des trophées\n# Corrections de bugs de trophées\n# Correction des caractéristiques impossibles\n# Remise en marche de la page Modération (pour les modérateurs)\n# Remise en place de l'interface de traduction (pour les traducteurs)",
	"changelog_189": "# Possibilité de recevoir des mails pour certaines notifications.\n# Affichage des fonctions dépréciées dans la documentation et l'éditeur\n# Correction des trophées Instruit et Konami\n# Ajout des traductions manquantes dans la documentation (getScience, getResistance, chipNeedLos, etc.)\n# Correction du trophée Schizophrène\n# Actualisation des habs lors du gain d'un combat\n# Correction de la popup de confirmation de la fermeture de l'éditeur\n# Ajout des notifications de défi éleveur\n# Correction du menu latéral (onglet sélectionné sur mauvaise page)\n# Amélioration du graphique dans le rapport de combat\n# Possibilité de choisir le lissage des courbes sur le graphique\n# Possibilité de cacher ou d'afficher les panneaux de statistiques dans le rapport.\n# Amélioration du tableau des statistiques dans le rapport de combat\n# (Ré)ajout du récapitulatif des avertissements et des erreurs dans le rapport de combat\n# Préservation des espaces et des tabulations dans les logs personnels\n# Traduction complètes en anglais et français de la documentation (merci à asmodai !)",
	"changelog_190": "# Ajout de 3 armes de corps à corps : le glaive, la hache et le katana, qui infligent de lourds dégâts et entravent la cible.\n# Amélioration du comptage des opérations sur les tableaux.\n# Corrections de l'aide générale\n# Corrections de bugs de CSS (signalé par Rominou)\n# Affichage des effets présents sur les entités en combat (signalé par Ebatsin)\n# Correction des victoires en tournoi non comptabilisés (pas sûr à 100%)\n# Trophée Légende et Mythique corrigés (à confirmer aussi).\n# Ajout de la fonction debugC, pour faire un debug de n'importe quelle couleur.\n# Ajout de 3 trophées (bonus).\n# Correction des raccourcis if, while, for etc. dans l'éditeur.\n# Ré-ajout de la fermeture automatique des (), [], {} etc.\n# Réduction de la taille des bulbes.\n# Le propriétaire de l'équipe est modérateur sur le forum de l'équipe.\n# Ajout de la fonction jsonEncode(object) et jsonDecode(json) pour encoder et décoder en JSON.\n# Un kill par poison était assigné à la cible dans le rapport de combat (signalé par Koneg).\n# Les fonction get(Weapon|Chip)(Max|Min)Scope sont remplacées par get(Weapon|Chip)(Max|Min)Range, les anciennes sont maintenant dépréciées.\n# Corrections mineures sur le tutoriel\n# debugE(\"\\\"\") affichait \"quote\" dans les erreurs du rapport.\n# Affichage de la popup d'information sur les fonctions personnelles dans l'éditeur.\n# Ctrl + Clic sur une fonction personnelle amène à sa définition.\n# Le vol de vie lorsque l'attaque tue la cible n'était pas bloqué à la vie restante de la cible.\n# Ajout d'une puce Antidote pour enlever tous les poisons d'une cible (sur soi ou un allié)\n# La fréquence augmente davantage la probabilité de commencer le combat.\n# Les coups critiques augmentent de 50% les effets au lieu de 25%.\n# Modifications des caractéristiques des bulbes : leurs caractéristiques sont diminuées, et ils possèdent seulement celles qui leur sont utiles.\n# La limite d'invocations par équipe passe à 6 au lieu de 4.\n# La puce Fracture enlève aussi de la magie.\n# Le gazeur n'inflige plus de dommages normaux, et ses dégâts de poisons sont légèrement diminués.\n# Le lance-flammes a une meilleure portée et plus de dégâts.\n# Les boosts sur poireaux sont sensiblement augmentés.\n# Les deux grandes entraves PT et PM (Somnifère et Boulet), ont maintenant une zone de 5 cases de diamètre.\n# Ajout des chapeaux chinois et de sorcier",
	"changelog_191": "# Possibilité de report quelqu'un sur le chat (paroles incorrectes ou flood).\n# Possibilité pour les modérateurs de mute les personnes sur le chat.\n# Ajout de la fonction getFarmerCountry().\n# Possibilité de changer le propriétaire de l'équipe.\n# Ajout de l'option pour recevoir les mises à jour par mail.\n# Accélération du chargement du potager.\n# Il n'y a plus de renvoi de dégâts sur une cible qui a été tuée lors d'une attaque.\n# Correction freeze dans l'éditeur\n# for (var i = 0; i < 10; i) {} (sans le '++' après le i) n'indiquait pas d'erreur mais échouait à la compilation.\n# Correction de l'accès au rapport sur un combat de test d'équipe.\n# Ajout d'un message d'erreur sur le niveau requis lors de la création d'un nouveau poireau.\n# Correction constantes de puces en double dans la doc (signalé par Onys).\n# Correction de la formule des boucliers relatifs dans l'aide.\n# Correction de la documentation de getCellToUseChip() à 3 paramètres.\n# Correction de la mise à jours des talents moyens (solo et farmer).\n# Bug de scroll lors de la réception d'un MP sur une autre conversation.\n# Des noms censurés pouvaient apparaître sur le forum.\n# Corrections de fautes d'orthographe.\n# Ajout d'un bouton déconnexion sur la page du farmer.\n# Amélioration affichage du forum sur mobile.\n# Taille des messages sur le chat limités à 1000 caractères.\n# Correction de lineOfSight pour les rares cas de non-symétrie.\n# Correction de la doc de debugC, et affichage des couleurs dans le rapport.\n# Correction de l'affichage des entraves dans le combat et le rapport.\n# Les entraves force et magie sont maintenant cumulables.\n# Correction du bouton annuler dans la popup de création de topic.\n# Correction du trophée déserteur.\n# Correction revanche défi éleveur.\n# Certaines images d'effets étaient cassées dans le combat.",
	"changelog_192": "# Corrections des votes forum.\n# Corrections des noms \"undefined\" dans la recherche forum (signalé par Rominou).\n# Ajout de scroll sur les pages rapport de combat et classement pour les gros tableaux.\n# Correction de la taille des messages lors de l'édition.\n# Ré-ajout du trophée Lucky.\n# Correction des trophées relatifs aux combats de test.\n# Accélération du chargement des pages poireau, farmer, équipe et potager.\n# HTTPS\n# Amélioration de l'affichage du combat sur mobile.\n# Ajout d'un web manifest.\n# Correction du compteur de défis en défi farmer.\n# Le classement des jours connectés d'affilée devient les jours connectés au total.\n# Davantage de messages sauvegardés sur le chat de team.\n# Correction des buffs de bulbes qui restaient actifs après la mort du bulbe.\n# La distance parcourue n'est plus comptée en défi.\n# Correction de traductions anglaises dans le tutoriel.\n# Affichage des avertissements sur la page de l'éleveur.\n# Accélération du chargement du classement fun.\n# Nouveaux icônes réseaux sociaux en bas de la page.\n# Ajout du chapeau de paille.\n# Les puces Épine et Miroir possèdent désormais une zone d'effet de 5 cases.\n# Battle Royales !",
	"changelog_193": "# Amélioration de l'inscription aux Battle Royales avec une fenêtre popup.\n# Retrait du niveau des fonctions dans la popup de l'éditeur.\n# Correction documentation getWeaponMaxRange.\n# Noms des mois plus courts dans le graphique du talent.\n# Amélioration de la détection des URLs dans les chats.\n# Ajout d'une option de tri par catégorie pour les puces dans le marché.\n# Correction de l'espace ajouté au milieu d'un mot lors d'un appui sur Entrer.\n# Correction de la traduction du trophée \"Planqué\".\n# Ajout des instructions de formattage dans la popup de création de topic.\n# Ajout des boutons Twitter, Facebook et Github sur la page À propos.\n# Nouvel icône pour la web app.\n# Lorsqu'un joueur quitte une équipe, il est désinscrit de ses topics de forum.\n# Correction du crash de getFarmerCountry() quand l'éleveur n'a pas de pays.\n# IA correctement supprimées côtés serveur (bug des IA fantômes).\n# Épine et mirroir ne s'appliquent plus sur les ennemis dans la zone.\n# Correction des trophées Monstre à Titan (impossibles à obtenir).\n# Ajout de l'avatar du joueur dans les mails de réponse forum.\n# Documentation de getFarmerCountry.\n# Correction des liens vers la documentation depuis le tutoriel.\n# Ajout des constantes dans la liste de la page documentation.\n# Correction des performance de certaines fonctions entraînant de très longs combats.\n# Ajout de nombreux emojis, dans le chat, les messages privés et le forum (avec l'aide de jojo123).\n# Possibilité de refaire un combat de test depuis la page rapport de combat (avec l'aide de TheTintin).\n# Ajout d'un bandeau dans les chats si nouveau message n'est pas visible.\n# Affichage du capital investi dans chaque caractéristique sur la page poireau (avec l'aide de Tintin).",
	"changelog_194": "# Ajout d'un système de dossiers pour ranger les IAs.\n# Unification des compteurs de combats solo, éleveur et battle royale dans un seul compteur.\n# Les anciens combats sont à nouveau visionnables.\n# Ajout de nouveaux bruitages et ambiances dans les combats (merci à BadPick !)\n# Ajout de la page Roadmap : https://leekwars.com/roadmap.\n# Ajout du grade contributeur, qui remplace le grade VIP.\n# Corrections sur la popup des Battle Royales.\n# Ajout de commandes dans le chat : /doc, /wiki, /shrug.\n# Correction de urls avec des tirets.\n# Correction des commentaires sous les combats et tournois.\n# Correction de la taille du combat lorsqu'on le quitte en plein écran.\n# Smileys et emojis plus grands lorsqu'ils sont seuls dans un message.",
	"changelog_195": "# Refonte de l'interface de test : ajouts d'options avancées pour paramétrer ses combats de test.\n# Amélioration du profil éleveur : ajout du nombre de messages forum, du site web et du profil GitHub.\n# Amélioration des signalements d'emblèmes d'équipe.\n# Correction d'un bug de sauvegarde d'une IA (merci à jeuxjeux20).\n# Amélioration du rafraichissement des messages privés (merci à Rominou).\n# Correction de la recherche dans le forum par nom de joueur.\n# Amélioration des messages d'erreurs relatifs aux IA dans le potager (merci à TheTintin).\n# Corrections dans la traduction anglaise du site (merci à MDMCK10 et jeuxjeux20).\n# Corrections relatifs à la barre de progression dans l'affichage du combat (merci à artorias).\n# Reconnection à la Battle Royale après de l'actualisation de la page.\n# Correction de l'indentation des codes d'exemple dans le tutoriel.",
	"changelog_196": "# Ajout d'une console LeekScript v2 (bêta)\n# Possibilité d'écrire des IA v2 dans l'éditeur (bêta)",
	"changelog_197": "# Correction du choix du thème dans l'éditeur.\n# Ajout d'un bouton Random dans la console LeekScript.\n# Possibilité de sélectionner le dossier racine dans l'éditeur (merci à Amal).\n# Amélioration de la sélection et de la présentation des armes et des puces sur la page poireau (merci à Tintin).\n# Correction et ajout de traductions.\n# Amélioration du chargement du mode discret (s'active instantanément au chargement de la page).\n# Amélioration du scroll et de la gestion des ancres (lien vers un message précis dans le forum).\n# Amélioration des signalements et de la modération.\n# Ajout de la page des statistiques (leekwars.com/statistics).\n# Ajout d'un compteur de vues sur les combats.",
	"changelog_198": "# Le talent d'équipe est désormais le talent de la meilleure compo (au lieu de la moyenne).\n# Affichage de la progression de la BR dans le titre de la page.\n# Amélioration de la page combat en cas de BR (titre et écran de chargement).\n# Amélioration de l'interface des commentaires sur les pages combat et tournoi.\n# Affichage du tour au passage de la souris sur la barre de progression des combats (merci à Twilight).\n# Affichage d'un message dans le chat et notification lorsqu'une BR se lance.\n# Possibilité de naviguer dans le marché avec les flèches du clavier.\n# Ajout de l'achat de combats dans le marché.\n# Historique détaillé des combats pour les poireaux et les éleveurs.\n# Ajout d'une option pour afficher les résultats des combats dans les notifications.\n# Les BR rapportent des habs et de l'XP mais coûtent désormais 1 combat.\n# Possibilité d'acheter des cristaux avec StarPass (SMS et téléphone).\n# Ajout d'un système d'érosion : la vie max diminue de 5% des dégâts subits et 10% pour le poison.\n# Rééquilibrage de certaines puces (voir forum pour les détails).\n# Notification marquée comme lue lorsque l'on clique dessus.\n# Réinitialisation du titre de la page et du compteur lors de la déconnexion.\n# Affichage de la date complète des messages sur les chats.\n# Correction du survol du graphique sur la page rapport de combat.\n# Correction de l'apparition de fenêtres fantômes de l'éditeur.\n# Correction de l'affichage du didactitiel lors de la première connexion.\n# Correction de la fermeture des popups dans le cas de plusieurs popups.\n# Correction de l'affichage des labels du graphique de talent sur la page poireau.\n# Corrections et améliorations sur les BR : synchronisation entre onglets et autres petits bugs.\n# Accélération du chargement des classements fun.\n# Correction du calcul des dégâts du poison dans les rapports de combat (merci à Pump).",
	"changelog_199": "# Bêta LeekScript V2 lancée ! Possibilité de faire des combats de test avec des IA v2.\n# Amélioration des files d'attente de combat : moins de blocages lorsqu'un joueur lance beaucoup de combats.\n# Refonte de l'interface de la version mobile du site : menu latéral, style material design, combats détaillés, etc.\n# Intégration des notifications push, sur desktop et mobile.\n# Ajout d'une page pour expliquer l'installation de l'app mobile : <a href='https://leekwars.com/app'>https://leekwars.com/app</a>.\n# Modification potager éleveur : les 3 premiers adversaires ont un talent équivalent, au lieu d'un talent inférieur.\n# Seulement un pack de 100 combat est achetable par jour en Habs (pas de limite avec les cristaux).\n# Érosion augmentée de 10% en cas de coup critique.\n# Mise à jour de la roadmap.\n# Ajout de la possibilité de rechercher dans une catégorie précise sur le forum.\n# Correction de la fonction édition d'un topic sur le forum.\n# Correction des trophées légende et mythique (enfin !).\n# Correction des résultats de combat dans l'historique éleveur.\n# Ajout d'une popup de confirmation lors de la suppression d'une composition.\n# Correction des barres d'XP trop grandes dans les rapports de combat.\n# Amélioration des performances de l'affichage des actions et logs en combats (merci à Amal).\n# Affichage des poireaux sur lesquels l'item est équipé dans le marché (merci à toufalk).\n# Correction du graphique du rapport de combat lors d'une résurrection (merci à Pump).",
	"changelog_200": "# Grandes avancées dans le LeekScript et le générateur de combats V2 : toujours en bêta !\n# Potager éleveur : écart de niveau maximum augmenté pour éviter les potagers vides.\n# Potager éleveur : éleveurs plus aléatoires dans la plage de talent donnée.\n# Bouton \"Rester connecté\" corrigé, et le cookie est renouvelé au cours du temps.\n# Possiblité de jouer les sons des puces et des armes en cliquant sur leur image dans le marché.\n# Poireaux plus petits dans l'affichage du combat.\n# Les valeurs des effets d'entraves (PT, PM, force, magie et vulnérabilité) sont désormais positives.\n# Les entraves ne sont plus diminuées par la science.\n# Ajout d'un booléen dans les effets renvoyés par getChip/WeaponEffects pour savoir si l'effet est cumulable.\n# Amélioration de l'actualisation des effets dans l'affichage du combat.\n# La puce libération ne supprime plus tous les effets mais réduit leur valeur de 50%.\n# Le cooldown de libération passe de 6 à 5 tours.\n# Mode tactique plus lisible, sans obstacles transparents.\n# Pause en combat discrète dans tous les cas, suppression de l'option.\n# Correction du survol des entités en combat avec la souris lorsque la page est zoomée.\n# Correction des animations de feu et de gaz qui restaient après la mort d'une entité.\n# L'option 'qualité du combat' change en 'afficher les ombres'.\n# Les détails d'une entité sont affichés en passant la souris dessus en combat.\n# Les effets de vulnérabilité sont désormais cumulables (merci à Pump).\n# Les dégâts de Machine Gun passent de 20-24 à 30-35.\n# Affichage des effets sous la barre de vie de chaque entité en combat.\n# Affichage des valeurs des effets en combat dans la popup de détails de l'entité.\n# Affichage des durées en années si supérieure à 12 mois.\n# Ajout de la liste des armes et des puces des entités dans le rapport de combat (for Pump).\n# Lors d'un changement de mot de passe, toutes les sessions de l'éleveur sont terminées (merci à Rominou).\n# Correction des regex de liens multilignes.\n# Correction d'un bug de plein écran avec F11 ou Échap (merci à HorsSujet).",
	"changelog_201": "# Passage du site web en Vue.js.\n# Chargement plus rapide et fluide entre les pages.\n# Refonte graphique légère.\n# Refonte du design des chats.\n# Actualisation des talents d'eleveur et poireaux dans l'interface apres la fin d'un combat.\n# Le trophée explorateur est désormais débloquable en tournoi solo.\n# Il est maintenant impossible de ressusciter une entité (poireau ou bulbe) d'une autre équipe.\n# Correction du bug d'argent bloqué à 2147483647.\n# Combat : affichage des zones d'effet des puces Toxine, Peste, Boulet, Somnifère, Mirroir et Épine.\n# Page potager : affichage du temps restant avant l'ajout de combat corrigé pour tous les fuseaux horaires.\n# Page historique : amélioration de la page sur la version mobile.\n# Éditeur : ajout d'une option pour changer la hauteur de ligne.\n# Statistiques : ajout d'un graphique sur les types de dégâts.\n# Forum : amélioration du design sur la version mobile.\n# Correction de la position des logs personnels dans les actions de combat.",
	"changelog_202": "# Rééquilibrage des niveaux et prix de nombreux items, ainsi qu'un léger nerf de la science (voir détail sur le topic forum).\n# La limite d'invocation pour une équipe passe de 6 à 8.\n# Ajout de la possibilité de filtrer les joueurs actifs dans le classement.\n# Ajout d'une carte spéciale tournoi.\n# Ajout de chats fenêtrés à la Facebook.\n# Changement du prix du pack de 100 combats en habs : à partir de 100000 jusqu'à 5 millions en fonction du niveau total.\n# Ajout d'un système pour relier des issues GitHub au sujets du forum.\n# Modération des descriptions d'équipe implémentée.\n# Amélioration de la fenêtre d'attente de Battle Royale.\n# Page historique : la période sélectionnée est mémorisée.\n# Rééquilibrage des gains d'XP et d'Habs entre les combats Solo et Éleveur : xp en solo réduite de moitié.\n# Plus de baisse d’XP et de gains de habs au niveau 99, 199 et 299 (baisse qui était incompréhensible).\n# Correction des retours à la ligne dans les logs personnels.\n# Correction d'un bug sur les trophées relatifs aux tournois.\n# Suppression de certains avatars de joueurs supprimés.\n# Correction de l'API leek/set-register quand le poireau n'a pas encore de registres.\n# Correction de la mise en valeur de son poireau/farmer/équipe sur l'affichage du tournoi.\n# Suppression de sa candidature lorsque l'on créé une nouvelle équipe.\n# Correction de l'affichage des BR dans les historiques de combat.\n# Correction de la description de la fonction arrayFoldRight.\n# Suppression du boutton 'supprimer' sur un topic pour les non-modérateurs.\n# Correction d'un bug avec le caractère $ dans les liens.\n# Les poireaux de test créés sont désormais de niveau 301.\n# Les chapeaux achetés sont correctement ajoutés dans l'inventaire sans besoin de recharger.\n# Correction d'un bug d'attribution des filleuls lorsqu'un éleveur a le même nom excepté la case.\n# Correction d'un bug au banissement d'un membre de l'équipe.\n# Amélioration du rafraichissement de la page à la création et la suppression d'une équipe.\n# Quelques corrections dans l'affichage du combat : lasers, synchro des animations, taille du combat.\n# Suppression des trophées bonus apparaissant dans la grille des trophées.\n# Les commandes du chat ne sont plus déclenchées après un '/' avec un caractère juste devant.",
	"changelog_203": "# Création d'une application Android (qui reprend l'application Web).\n# Design : barres de défilements plus discrètes pour les éléments à l'intérieur de la page (surtout l'éditeur en thème sombre).\n# API : le token passé via un header Authorization.\n# API : les erreurs sont gérées par un status HTTP 400 au lieu d'un success: false (les succès sont en status 200).\n# API : utilisation de méthodes PUT et DELETE sur certaines API au lieu de POST.\n# Combat : correction de l'affichage des effets du Glaive.\n# Combat : correction de l'affichage du signe de vulnérabilité.\n# Recherche forum : ajout d'une option de tri par pertinence, date et votes + filtre modérateur et admin.\n# Recherche forum : affichage du nombre total de résultats.\n# Recherche forum : correction du surglignage du résultat dans les titres dans le cas d'une recherche de plusieurs mots.\n# Recherche forum : le clic sur un résultat emmène sur le message précis dans la page du topic.\n# Potager : correction de la sélection du poireau et de la composition par défaut après un changement de compte.\n# Potager : correction du retour arrière en mode défi.\n# Classement : amélioration de la recherche : possibilité d'aller sur le classement du résultat ou sa page + images améliorées.\n# Classement : le filtre 'classement actif' reste activé au changement de page et d'ordre sur les classements éleveur et équipe.\n# Éditeur : Ctrl + survol surligne la fonction ou la constante et change le curseur de la souris.\n# Éditeur : ajout de tooltips sur les puces et les armes des poireaux de test.\n# Éditeur : correction de la fonctionnalité 'sauvegarde avant un test'.\n# Trophées : ajout d'une option pour masquer les trophées déjà obtenus.\n# Messages privés : l'ancienne conversation est récupérée avant d'envoyer un message à un éleveur.",
	"changelog_204": "# Éditeur : ajout d'onglets pour gérer les IA ouvertes.\n# Éditeur : le panneau de gauche est redimensionnable.\n# Lecteur de combat : réorganisation des commandes.\n# Lecteur de combat : clic pour mettre en pause et ajout d'animations.\n# Lecteur de combat : affichage des valeurs des effets sous la barre de vie.\n# Amélioration de l'affichage des historiques (affichage en grille).\n# Ajout de tooltips dans l'éditeur à propos de la bêta du LS2.\n# Ajout du wiki bêta dans l'aide.\n# Amélioration du mode discret.\n# Corrections des messages d'erreur de la banque.\n# Mise à jour du niveau du poireau partout lors d'un gain de niveau.\n# Correction de la puce steroïdes.\n# Correction d'animation sur le grenade launcher.\n# Correction du message de la candidature courante sur la page de l'éleveur.\n# Possibilité de consulter un tournoi sans être connecté.\n# Correction d'un bug qui n'affichait pas le capital restant d'un poireau sur sa page.\n# Correction de l'affichage des IA et des dossiers sélectionnés dans l'éditeur.\n# Inscription : ajout d'icônes sur les boutons Connexion et Inscription.",
	"changelog_205": "# Éditeur : possibilité de replier/deplier les blocs et commentaires.\n# Changelog : affichage des images des mises à jour.\n# Réorganisation de la page paramètres (partie paramètres du compte).\n# Paramètres : possibilité de changer son adresse email.\n# Lecteur de combat : affichage des durées des effets sous la barre de vie et dans les actions.\n# Ajout d'un bouton 'Fermer' à tous les dialogues.\n# Lecteur de combat : les barres de vie des entitées autour de l'entité survolée sont masquées pour faciliter la lecture.\n# Classement : les boutons pour afficher notre position fonctionnent avec les classements actifs.\n# Combat : affichage de l'arme dans l'action '<poireau> attaque avec <arme>'.\n# Optimisation générale des performances du site (pages plus rapides à charger).\n# Infobulles avancées des caractéristiques au survol des éleveurs et poireaux.\n# Amélioration de l'affichage des détails d'une entité en combat et possibilité de les verrouiller en cliquant.\n# Documentation : correction de quelques erreurs (include, weaponNeedLos et isInlineWeapon).\n# Lecteur de combat : correction des états feu et gaz persistants après un saut dans le combat.\n# Lecteur de combat : correction du bug qui lisait la musique de fond en quittant la page rapidement.\n# Lecteur de combat : amélioration de l'affichage au moment du démarrage du combat.\n# Lecteur de combat : correction du survol des entités avec la souris + affichage de la cellule ciblée.\n# Correction d'un bug qui empêchait de créer une IA lorsqu'elles sont toutes supprimées.\n# Forum : Amélioration des fils d'Ariane et affichage de ceux-ci sur la version mobile.",
	"changelog_206": "# Rééquilibrage des équipements (voir le sujet forum).\n# Ajout de l'effet Vulnérabilité absolue (EFFECT_ABSOLUTE_VULNERABILITY).\n# Amélioration de la page d'inscription : nouveaux liens, classement d'équipe, nouvelles captures d'écran.\n# Amélioration du design de la banque (nouvel icône crystal).\n# Éditeur : amélioration de la colorisation pour LeekScript V2.\n# Affichage des bots sur la page de chargement de combat + éleveur 'Leek Wars' en bas du combat.\n# Amélioration de la gestion de la file d'attente des combats.\n# Combat : affichage de l'éleveur qui a démarré le combat.\n# Amélioration du temps de chargement du site (chargement différé de certains modules).\n# Infobulles riches : infobulles imbriquées + l'état étendu est sauvegardé d'une ouverture à l'autre.\n# Amélioration de l'affichage et des performances des emojis (utilisation des emojis natifs si possible).\n# Les combats de tournoi sont affichés avec un icône de coupe dans les historiques.\n# Combat : les effets avec une valeur de zéro ne sont pas créés.\n# Reconnexion automatique du chat réimplémentée.\n# Amélioration de l'animation de l'électriseur.\n# Amélioration de l'affichage des indicateurs sur le rapport de combat\n.# Trophées série de victoire : une égalité de remet plus à zéro la série.\n# Correction du trophée Exploreur.\n# Correction de l'affichage des flags sur la page rapport de combat.\n# Les onglets de l'éditeur sont effacés lors d'un changement de compte.\n# Accélération du chargement du chat (tous les messages envoyés en un paquet).\n# Ajout du panneau des émojis sur le forum.",
	"changelog_207": "# Ajout des Tourelles d'équipe.\n# Ajout de la puce Châtiment.\n# Le niveau des poireaux de test est calculé automatiquement selon ses items équipés.\n# Divers améliorations de l'interface de configuration du test (traduction, design, ergonomie).\n# Éditeur : amélioration de la création d'IA et dossier : choix du nom sans à avoir à renommer.\n# Éditeur : meilleure synchronisation des IA créées et supprimées sur tout le site. #509\n# Correction du design des popups.\n# Correction de l'affichage du menu de notification sur petits écrans mobiles.\n# Quand un poireau équipe une arme, la perte de PT se fait après l'action SET_WEAPON.\n# Correction de l'affichage des registres qui débordaient sur la page poireau.\n# Ajout de la documentation pour les constantes EFFECT_* (merci à Tabc3dd).\n# Ajout des constantes SUMMON_LIMIT et CRITICAL_FACTOR dans la documentation.\n# Ajout d'un bouton pour visualiser la fenêtre des caractéristiques même quand le capital est à zéro.\n# Correction d'un bug sur getWeapons() avec les poireaux de tests.\n# Amélioration du design de la popup potions sur la page poireau.\n# Lorsqu'une IA est supprimée, elle est correctement déséquipée des poireaux qui l'avait équipé.\n# Possibilité de supprimer un poireau de test.\n# Amélioration de la synchronisation des scénarios de test (édition d'un poireau de test ou carte).\n# Correction des cartes de test personnalisées.\n# Ajout de la possibilité de faire des combats de test en mode Battle Royale.\n# Ajout de la possibilité de faire des combats avec ses alliés d'équipe dans n'importe quel mode.\n# Ajout d'un système de modèles pour créer plus facilement des scénarios de test.\n# Correction d'un bug qui rendait certains anciens combats inaccessibles.\n# Correction des icônes du Double gun et du Shotgun dans les effets sous les barres de vie.\n# Correction d'un bug mélangeant les couleurs des poireaux en combat.",
	"changelog_208": "# Affichage de la date d'obtention du trophée et du combat sur la page éleveur en mode grille.\n# Affichage des trophées obtenus pendant le combat sur la page rapport. #268\n# Ajout de la syntaxe `code` et ```code``` dans les chats et les messages privés pour afficher du code. #120\n# Affichage des commentaires du combat sur la page rapport.\n# Affichage des notifications non lues en vert, cliquer dessus pour la lire.\n# Ajout des commandes /update, /issue et /pr dans le chat.\n# Ajout d'un onglet marché dans la banque.\n# Page trophées : affiche si un trophée est déblocable en combat ou non.\n# Changelog : ajout de sections Nouveautés, Améliorations, Corrections.\n# Ajout de la fonction getSummons() pour récupérer la liste des invocations d'une entité.\n# Ajout de l'arme J-Laser : vole du bouclier absolu en zone.=====# Amélioration du défilement des actions et des logs personnels en combat.\n# Affichage de l'animation de la puce Antidote en vert pour différencier de Libération.\n# Affichage des effets négatifs avec un '-' devant.\n# Envoi des notifications de fin de round de tournoi quand tout le round est entièrement terminé.\n# Combat : les effets qui tombent à 0 après une libération sont supprimés.\n# Affichage de la zone d'effet des lasers et du lance-flammes.\n# Les classements de la page d'inscription sont désormais des classements actifs.\n# Au début du combat, les poireaux sont correctement orientés en regardant le centre de la carte.\n# Amélioration du style de la fenêtre de choix des armes sur mobile.\n# Amélioration de la fluidité de l'animation de chargement.\n# Retrait du lien vers Google+ dans le footer.\n# Ajout d'un icône sur le bouton potions sur la page poireau.\n# Affichage du contour des zones d'effet en combat + ajustement des couleurs de ces zones.\n# Les barres de vie sont maintenant bleues et rouges pour améliorer la lecture du combat.\n# Le poireau se tourne vers son invocation quand il l'invoque.\n# Affichage de la barre de vie globale sur mobile.\n# Amélioration de l'indication de l'entitée sélectionnée et survolée.\n# La formule des dégâts de zone change : selon la distance au centre : 80%, 60% et 40%.\n# Le glaive donne 30 de force à soi-même sur 2 tours au lieu d'enlever des PT à la cible.\n# Les effets du même item, même lanceur et même durée sont maintenant regroupés pour plus de lisibilité.=====# Correction de la longueur des lasers pour coller à leur portée réelle\n# Correction d'un léger problème d'espaces sur tout le site suite à une mise à jour de Vue.\n# Correction de l'affichage des noms de parrains censurés sur la page éleveur.\n# Correction de la notification de victoire en tournoi d'équipe.\n# Correction de la sauvegarde de la langue sélectionnée dans les paramètres."
}